src/Catalogs/Публикации/Публикации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Публикации</name>
  <attributes>
    <name>УдалитьЛогин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьТелоОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветДляСравнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьПеренаправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаЭксплуатации</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаДляВосстановления</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/БезопасноеХранилище/БезопасноеХранилище.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БезопасноеХранилище</name>
  <resources>
    <name>ДанныеХранилища</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецХранилища</name>
    <type>
      <types>CatalogRef.НастройкиАнализаПроблемПроизводительности</types>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.Публикации</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>CatalogRef.ВидыОбъектовКонтроля</types>
      <types>String</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Публикации/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьПривилегированныйРежим(Истина);
		ДанныеХранилища = РегистрыСведений.БезопасноеХранилище.ПолучитьДанные(Объект.Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ДанныеХранилища <> Неопределено Тогда
			ЭтотОбъект.Логин = ДанныеХранилища.Логин;
			ЭтотОбъект.Пароль = ДанныеХранилища.Пароль;
        КонецЕсли;
    КонецЕсли;
    
    ЗаполнитьПараметрыИнцидентов();
    
    Если Объект.ПлощадкаЭксплуатации = Справочники.ПлощадкиЭксплуатации.Корзина() Тогда
        
        ЭтотОбъект.ТолькоПросмотр = Истина;
        
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеХранилища = Новый Структура("Логин, Пароль");
	ДанныеХранилища.Логин = ПараметрыЗаписи.Логин;
	ДанныеХранилища.Пароль = ПараметрыЗаписи.Пароль;
	РегистрыСведений.БезопасноеХранилище.ЗаписатьДанные(ТекущийОбъект.Ссылка, ДанныеХранилища);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПараметрыЗаписи.Вставить("Логин", ЭтотОбъект.Логин);
	ПараметрыЗаписи.Вставить("Пароль", ЭтотОбъект.Пароль);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьОтвет(Команда)
	Результат = ЗагрузитьОтветНаСервере(Объект.АдресРесурса, ЭтотОбъект.Логин, ЭтотОбъект.Пароль);
	Если Результат.КодСостояния = 200 Тогда
		Объект.ОтветДляСравнения = Результат.Тело;
	Иначе
		Сообщить("Ошибка подключения. Код ответа: " + Результат.КодСостояния);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура АдресРесурсаПриИзменении(Элемент)
    
    Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
        Объект.Наименование = Объект.АдресРесурса;
    КонецЕсли;
    
    Для Каждого ТекСтрока Из ПараметрыИнцидентов Цикл
        
        ТекСтрока.КодИнцидента = "Публикация/" + Объект.АдресРесурса;
        
    КонецЦикла;
        
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗагрузитьОтветНаСервере(АдресРесурса, Логин, Пароль)
	Результат = ПубликацииКонтрольДоступности.ВыполнитьHTTPЗапрос(АдресРесурса, Логин, Пароль);
	
	РезультатНаКлиента = Новый Структура("КодСостояния, Тело");
	РезультатНаКлиента.КодСостояния = Результат.КодСостояния;
	Если Результат.КодСостояния = 200 Тогда
		РезультатНаКлиента.Тело = Результат.ПолучитьТелоКакСтроку();
	КонецЕсли;
		
	Возврат РезультатНаКлиента;
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыИнцидентов()
    
    НовСтрока = ПараметрыИнцидентов.Добавить();
    НовСтрока.ТипИнцидента = "Публикация";
    НовСтрока.КодИнцидента = "Публикация/" + Объект.АдресРесурса;
    
    НовСтрока = ПараметрыИнцидентов.Добавить();
    НовСтрока.ТипИнцидента = "НедоступностьНетДанных";
    НовСтрока.КодИнцидента = "Публикация/" + Объект.АдресРесурса;
    
КонецПроцедуры

#КонецОбласти
